{
    "proyectos": [
        {
            "nombre": "GAMEHYPE",
            "herramientas": ["React", "JavaScript", "HTML", "CSS", "JSON", "librerías de estilo", "axios", "API externa"],
            "descripcion": "App de videojuegos en la que podemos encontrar información de las principales plataformas, de las principales plataformas retro, y un apartado de venta de juegos. Para obtener la información que arrojamos en pantalla se ha usado una API externa y JSON_server local.",
            "paquetes": ["Ness.css", "Bootstrap", "REACT SPINNERS by David Hu"],
            "github": "https://github.com/fraestgue/gamehype",
            "enlace": "https://game-hype.netlify.app/"
        }, 
        {
            "nombre": "Ciclocero", 
            "herramientas": ["React", "JavaScript", "HTML", "CSS", "axios", "Express", "MongoDB", "Node.js", "React Context", "librerías de estilo"], 
            "descripcion": "Plataforma creada para entusiastas del ciclismo que buscan explorar nuevas rutas y compartir experiencias con otros usuarios de la comunidad ciclista. Con Ciclocero, los usuarios pueden crear, descubrir y compartir sus rutas favoritas para bicicleta, junto con descripciones detalladas, información sobre modalidad, distancias, reseñas, fotos y puntos de interés en el camino. Para plasmar la información se ha creado un servidor backend donde almacenamos la información de los distintos modelos (rutas, reseñas y usuarios), y las distintas rutas que hemos usado, tanto de verificación de usuarios como recibir información.",
            "paquetes": ["Bootstrap", "REACT SPINNERS by David Hu", "Leaflet", "react-simple-maps", "Cloudinary", "react-burger-menu"],
            "github": "https://github.com/fraestgue/ciclocero-project3",
            "enlace": "https://ciclocero.netlify.app/"
        },
        {
            "nombre": "Mandalorian",
            "herramientas": ["Manipulación de DOM", "JavaScript", "HTML", "CSS"],
            "descripcion": "Juego interactivo en el que debes disparar a los enemigos y salvar a los aliados, con mecánica de 'score' y de 'vidas' inspirado en la serie 'The Mandalorian' de la franquicia de 'Star Wars'. Puedes mover al personaje con las teclas ⬆️ ⬇️, y disparar con la tecla espaciadora. Tiene la opción de jugar con o sin música, y además tiene añadidos efectos de sonidos de los disparos y los impactos.",
            "paquetes": [],
            "github": "https://github.com/fraestgue/mandalorian",
            "enlace": "https://fraestgue.github.io/mandalorian/"
        }

    ]
}